Repository: Maua-Dev/clean_flutter_template
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# stateNameSchema
source: {schema, select, APPROVED{Approved} PENDING{Pending} REJECTED{Rejected} other{Other}}
pt_br: {schema, select, APPROVED{Aprovado} PENDING{Pendente} REJECTED{Rejeitado} other{Other}}

# homePageTitle
source: Welcome to Clean Flutter Template
pt_br: Bem-vindo ao Clean Flutter Template

# homePageSubtitle
source: Explore the features of the template:
pt_br: Explore as funcionalidades do template:

# createPageTitle
source: Create a new user
pt_br: Crie um novo usuário

# registerTitle
source: Register
pt_br: Cadastrar

# fieldName
source: Name
pt_br: Nome

# fieldPassword
source: Password
pt_br: Senha

# fieldHintEmail
source: example@example.com
pt_br: exemplo@exemplo.com

# fieldHintId
source: Identification number
pt_br: Número de identificação do usuário

# fieldRequired
source: Field is required
pt_br: Campo é obrigatório

# fieldMinLength
source: Field must be at least 6 characters long
pt_br: O campo deve ter pelo menos 6 caracteres

# fieldInvalidEmail
source: Field must be a valid email address
pt_br: O campo deve ser um endereço de e-mail válido

# successCreateUser
source: User {successCreateUser} created successfully
pt_br: Usuário {successCreateUser} criado com sucesso

# getPageTitle
source: Search for a user
pt_br: Procure um usuário

# searchTitle
source: Search
pt_br: Procurar

# updatePageTitle
source: Update an user
pt_br: Dê update em um usuário

# deletePageTitle
source: Delete an user
pt_br: Delete um usuário

# deleteTitle
source: Delete
pt_br: Deletar

# getAllPageTitle
source: List of all users
pt_br: Lista de todos os usuários

# successUpdateUser
source: User {successUpdateUser} updated successfully
pt_br: Usuário {successUpdateUser} updated com sucesso

# successDeleteUser
source: User {successDeleteUser} deleted successfully
pt_br: Usuário {successDeleteUser} deletado com sucesso

# entityErrorMessage
source: Field {entityErrorMessage} is not valid
pt_br: Campo {entityErrorMessage} não é válido

# emptyListErrorMessage
source: List is empty, no items found for this request
pt_br: Lista vazia, itens não encontrados para essa requisição

# noItemsFoundErrorMessage
source: No items found for {message}
pt_br: Itens não encontrados para: {message}
